/*
Nuklear - 1.37.0 - public domain
no warrenty implied; use at your own risk.
authored from 2015-2017 by Micha Mettke

ABOUT:
This is a minimal state graphical user interface single header toolkit
written in ANSI C and licensed under public domain.
It was designed as a simple embeddable user interface for application and does
not have any dependencies, a default renderbackend or OS window and input handling
but instead provides a very modular library approach by using simple input state
for input and draw commands describing primitive shapes as output.
So instead of providing a layered library that tries to abstract over a number
of platform and render backends it only focuses on the actual UI.

VALUES:
- Graphical user interface toolkit
- Single header library
- Written in C89 (a.k.a. ANSI C or ISO C90)
- Small codebase (~17kLOC)
- Focus on portability, efficiency and simplicity
- No dependencies (not even the standard library if not wanted)
- Fully skinnable and customizable
- Low memory footprint with total memory control if needed or wanted
- UTF-8 support
- No global or hidden state
- Customizable library modules (you can compile and use only what you need)
- Optional font baker and vertex buffer output

USAGE:
This library is self contained in one single header file and can be used either
in header only mode or in implementation mode. The header only mode is used

#else
#define NK_UNIQUE_NAME(name) NK_STRING_JOIN(name,__LINE__)
#endif

#ifndef NK_STATIC_ASSERT
#define NK_STATIC_ASSERT(exp) typedef char NK_UNIQUE_NAME(_dummy_array)[(exp)?1:-1]
#endif

#ifndef NK_FILE_LINE
#ifdef _MSC_VER
#define NK_FILE_LINE __FILE__ ":" NK_MACRO_STRINGIFY(__COUNTER__)
#else
#define NK_FILE_LINE __FILE__ ":" NK_MACRO_STRINGIFY(__LINE__)
#endif
#endif

#define NK_MIN(a,b) ((a) < (b) ? (a) : (b))
#define NK_MAX(a,b) ((a) < (b) ? (b) : (a))
#define NK_CLAMP(i,v,x) (NK_MAX(NK_MIN(v,x), i))
    /*
    * ===============================================================
    *
    *                          BASIC
    *
    * ===============================================================
    */
#ifdef NK_INCLUDE_FIXED_TYPES
#include <stdint.h>
#define NK_INT8 int8_t
#define NK_UINT8 uint8_t
#define NK_INT16 int16_t
#define NK_UINT16 uint16_t
#define NK_INT32 int32_t
#define NK_UINT32 uint32_t
#define NK_SIZE_TYPE uintptr_t
#define NK_POINTER_TYPE uintptr_t
#else
#ifndef NK_INT8
#define NK_INT8 char
#endif
#ifndef NK_UINT8
#define NK_UINT8 unsigned char
#endif
#ifndef NK_INT16
#define NK_INT16 signed short
#endif
#ifndef NK_UINT16
#define NK_UINT16 unsigned short
#endif
#ifndef NK_INT32
#if defined(_MSC_VER)
#define NK_INT32 __int32
#else
#define NK_INT32 signed int
#endif
#endif
#ifndef NK_UINT32
#if defined(_MSC_VER)
#define NK_UINT32 unsigned __int32
#else
#define NK_UINT32 unsigned int
#endif
#endif
#ifndef NK_SIZE_TYPE
#if defined(_WIN64) && defined(_MSC_VER)
#define NK_SIZE_TYPE unsigned __int64
#elif (defined(_WIN32) || defined(WIN32)) && defined(_MSC_VER)
#define NK_SIZE_TYPE unsigned __int32
#elif defined(__GNUC__) || defined(__clang__)
#if defined(__x86_64__) || defined(__ppc64__)
#define NK_SIZE_TYPE unsigned long
#else
#define NK_SIZE_TYPE unsigned int
#endif
#else
#define NK_SIZE_TYPE unsigned long
#endif
#endif
#ifndef NK_POINTER_TYPE
#if defined(_WIN64) && defined(_MSC_VER)
#define NK_POINTER_TYPE unsigned __int64
#elif (defined(_WIN32) || defined(WIN32)) && defined(_MSC_VER)
#define NK_POINTER_TYPE unsigned __int32
#elif defined(__GNUC__) || defined(__clang__)
#if defined(__x86_64__) || defined(__ppc64__)
#define NK_POINTER_TYPE unsigned long
#else
#define NK_POINTER_TYPE unsigned int
#endif
#else
#define NK_POINTER_TYPE unsigned long
#endif
#endif
#endif

    typedef NK_INT8 nk_char;
    typedef NK_UINT8 nk_uchar;
    typedef NK_UINT8 nk_byte;
    typedef NK_INT16 nk_short;
    typedef NK_UINT16 nk_ushort;
    typedef NK_INT32 nk_int;
    typedef NK_UINT32 nk_uint;
    typedef NK_SIZE_TYPE nk_size;
    typedef NK_POINTER_TYPE nk_ptr;

    typedef nk_uint nk_hash;
    typedef nk_uint nk_flags;
    typedef nk_uint nk_rune;

    /* Make sure correct type size:
    * This will fire with a negative subscript error if the type sizes
    * are set incorrectly by the compiler, and compile out if not */
    NK_STATIC_ASSERT(sizeof(nk_short) == 2);
    NK_STATIC_ASSERT(sizeof(nk_ushort) == 2);
    NK_STATIC_ASSERT(sizeof(nk_uint) == 4);
    NK_STATIC_ASSERT(sizeof(nk_int) == 4);
    NK_STATIC_ASSERT(sizeof(nk_byte) == 1);
    NK_STATIC_ASSERT(sizeof(nk_flags) >= 4);
    NK_STATIC_ASSERT(sizeof(nk_rune) >= 4);
    NK_STATIC_ASSERT(sizeof(nk_size) >= sizeof(void*));
    NK_STATIC_ASSERT(sizeof(nk_ptr) >= sizeof(void*));

    /* ============================================================================
    *
    *                                  API
    *
    * =========================================================================== */
    struct nk_buffer;
    struct nk_allocator;
    struct nk_command_buffer;
    struct nk_draw_command;
    struct nk_convert_config;
    struct nk_style_item;
    struct nk_text_edit;
    struct nk_draw_list;
    struct nk_user_font;
    struct nk_panel;
    struct nk_context;
    struct nk_draw_vertex_layout_element;
    struct nk_style_button;
    struct nk_style_toggle;
    struct nk_style_selectable;
    struct nk_style_slide;
    struct nk_style_progress;
    struct nk_style_scrollbar;
